git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-13 Wed 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git From the Ground Up</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Hamrick" />
<link rel="stylesheet" type="text/css" href="/Users/mikeh/css/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/Users/mikeh/css/readtheorg/css/font-awesome.min.css"/>
<link rel="stylesheet" type="text/css" href="/Users/mikeh/css/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Git From the Ground Up</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5bb7a11">Introduction</a></li>
<li><a href="#orgba49a3f">Where are we, and is git happy?</a></li>
<li><a href="#org4473448">Let's create a .git directory</a></li>
<li><a href="#org6511cce">Let's create some things</a></li>
<li><a href="#orgac3d467">Let's hash something!</a></li>
<li><a href="#orga98a1e9">Where did git put it?</a></li>
<li><a href="#orgf69477a">Can we just look at the object?</a></li>
<li><a href="#orgf858fe7">Let's do it ourselves</a></li>
<li><a href="#org5d4fe45">Did it work?</a></li>
<li><a href="#orgf00cffd">Final thoughts</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5bb7a11" class="outline-2">
<h2 id="org5bb7a11">Introduction</h2>
<div class="outline-text-2" id="text-org5bb7a11">
<p>
We're going to learn a little something about the git data model by crafting the
<code>.git</code> directory and a blob object by hand. It'll be fun!
</p>
</div>
</div>

<div id="outline-container-orgba49a3f" class="outline-2">
<h2 id="orgba49a3f">Where are we, and is git happy?</h2>
<div class="outline-text-2" id="text-orgba49a3f">
<p>
Let's start by seeing where we are, and if we're in a valid git repository.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"My current working dir is: $(</span><span style="color: #CC9393;">dirs</span><span style="color: #CC9393;"> +0)"</span>
git status 2&gt;&amp;1 || <span style="color: #DCDCCC; font-weight: bold;">echo</span> Git is not happy.
</pre>
</div>

<pre class="example">
My current working dir is: ~/org/tmp
fatal: not a git repository (or any of the parent directories): .git
Git is not happy.
</pre>
</div>
</div>

<div id="outline-container-org4473448" class="outline-2">
<h2 id="org4473448">Let's create a .git directory</h2>
<div class="outline-text-2" id="text-org4473448">
<p>
OK, so we know that we need a <code>.git</code> directory to start things off. Let's create
one now.
</p>

<div class="org-src-container">
<pre class="src src-shell">mkdir -p .git
git status 2&gt;&amp;1 || <span style="color: #DCDCCC; font-weight: bold;">echo</span> Git is not happy.
</pre>
</div>

<pre class="example">
fatal: not a git repository (or any of the parent directories): .git
Git is not happy.
</pre>

<p>
Still not happy, clearly we've got some work to do.
</p>
</div>
</div>

<div id="outline-container-org6511cce" class="outline-2">
<h2 id="org6511cce">Let's create some things</h2>
<div class="outline-text-2" id="text-org6511cce">
<p>
Git needs a few things to be happy &#x2013; it needs a place to stash objects, a place
to track refs, and a HEAD file which points to our current commit.
</p>

<div class="org-src-container">
<pre class="src src-shell">mkdir -p .git/objects
mkdir -p .git/refs
mkdir -p .git/refs/heads
<span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"ref: refs/heads/master"</span> &gt; .git/HEAD
tree .git/
</pre>
</div>

<pre class="example">
.git/
├── HEAD
├── objects
└── refs
    └── heads

3 directories, 1 file
</pre>

<p>
This is essentially the skeleton we need for git, just three directories and
one file. At this point git should be totally happy, let's verify.
</p>

<div class="org-src-container">
<pre class="src src-shell">git status 2&gt;&amp;1 || <span style="color: #DCDCCC; font-weight: bold;">echo</span> Git is not happy.
</pre>
</div>

<pre class="example">
On branch master

No commits yet

nothing to commit (create/copy files and use "git add" to track)
</pre>

<p>
OK great, when git is happy, everyone is happy!
</p>
</div>
</div>

<div id="outline-container-orgac3d467" class="outline-2">
<h2 id="orgac3d467">Let's hash something!</h2>
<div class="outline-text-2" id="text-orgac3d467">
<p>
We're going to hash the string "Welcome to SeaGL 2019!" by using the git
plumbing command <code>hash-object</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgde8dcad"><span style="color: #DCDCCC; font-weight: bold;">echo</span> -n <span style="color: #CC9393;">'Welcome to SeaGL 2019!'</span> | git hash-object --stdin -w
</pre>
</div>

<pre class="example">
05d5390cf537efeab95b0e80c987b83fc855bca0
</pre>

<p>
So we've asked git to hash the content we passed in via STDIN and we've also
asked it to store it in the object database. It returned a 40 character SHA1 hash
of the content, and if you've ever worked with git before you've likely seen
these. You can also refer to this hash by its first four characters like
<code>05d5</code> which is pretty handy.
</p>
</div>
</div>

<div id="outline-container-orga98a1e9" class="outline-2">
<h2 id="orga98a1e9">Where did git put it?</h2>
<div class="outline-text-2" id="text-orga98a1e9">
<p>
In the previous example we asked <code>git hash-object</code> to write our string the objects
database. Let's see how that was stored in the <code>.git</code> directory.
</p>

<div class="org-src-container">
<pre class="src src-shell">tree .git
</pre>
</div>

<pre class="example">
.git
├── HEAD
├── objects
│   └── 05
│       └── d5390cf537efeab95b0e80c987b83fc855bca0
└── refs
    └── heads

4 directories, 2 files
</pre>

<p>
Because file systems get angry with you when you stash too many files in the same
directory, git shards the directory based on the first two bytes of the hash.
</p>
</div>
</div>

<div id="outline-container-orgf69477a" class="outline-2">
<h2 id="orgf69477a">Can we just look at the object?</h2>
<div class="outline-text-2" id="text-orgf69477a">
<p>
Let's see if we can find part of the string we hashed inside the object.
</p>

<div class="org-src-container">
<pre class="src src-shell">grep -F Welcome .git/objects/05/d5390cf537efeab95b0e80c987b83fc855bca0 || <span style="color: #DCDCCC; font-weight: bold;">echo</span> Nope.
</pre>
</div>

<pre class="example">
Nope.
</pre>

<p>
Nope. Git stores the objects in compressed format, but we can use <code>git cat-file</code>
to take a peek inside it. We'll run it with the <code>-p</code> argument to pretty-print the
object. We'll also reference the object by its short name, because typing long
git hashes is no fun!
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org337b6ce">git cat-file -p 05d5
</pre>
</div>

<pre class="example">
Welcome to SeaGL 2019!
</pre>
</div>
</div>

<div id="outline-container-orgf858fe7" class="outline-2">
<h2 id="orgf858fe7">Let's do it ourselves</h2>
<div class="outline-text-2" id="text-orgf858fe7">
<p>
OK, let's figure out how git compresses the file.
</p>

<div class="org-src-container">
<pre class="src src-shell">cat .git/objects/05/d5390cf537efeab95b0e80c987b83fc855bca0 | file -
cat .git/objects/05/d5390cf537efeab95b0e80c987b83fc855bca0 | gunzip || <span style="color: #DCDCCC; font-weight: bold;">echo</span> Nope.
</pre>
</div>

<pre class="example">
/dev/stdin: VAX COFF executable - version 19790
Nope.
</pre>

<p>
Neither <code>file</code> or <code>gunzip</code> no quite what to make of it. I happen to know that it's a <code>zlib</code>
stream. The program <code>pigz</code> can deal with these.
</p>

<div class="org-src-container">
<pre class="src src-shell">cat .git/objects/05/d5390cf537efeab95b0e80c987b83fc855bca0 | pigz -d | hexdump -C
</pre>
</div>

<pre class="example">
00000000  62 6c 6f 62 20 32 32 00  57 65 6c 63 6f 6d 65 20  |blob 22.Welcome |
00000010  74 6f 20 53 65 61 47 4c  20 32 30 31 39 21        |to SeaGL 2019!|
0000001e
</pre>

<p>
We can see from the hex output that git is storing our hashed string with a
header, which contains <code>blob</code> which is the type of thing we're storing, followed
by <code>22</code>, which is the number of bytes of the thing we're
storing, followed by a null byte.
</p>

<p>
Since we're doing things from the ground up, let's hash it ourselves using
Python.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> hashlib
<span style="color: #DFAF8F;">hashme</span> = <span style="color: #CC9393;">'Welcome to SeaGL 2019!'</span>
<span style="color: #DFAF8F;">header</span> = <span style="color: #CC9393;">"blob "</span> + <span style="color: #DCDCCC; font-weight: bold;">str</span>(<span style="color: #DCDCCC; font-weight: bold;">len</span>(hashme)) + <span style="color: #CC9393;">"\0"</span>
<span style="color: #DFAF8F;">myblob</span> = (header + hashme).encode(<span style="color: #CC9393;">'utf8'</span>)
<span style="color: #DFAF8F;">gitsha</span> = hashlib.sha1(myblob).hexdigest()

<span style="color: #F0DFAF; font-weight: bold;">print</span>(gitsha)
</pre>
</div>

<pre class="example">
05d5390cf537efeab95b0e80c987b83fc855bca0
</pre>

<p>
So now we've figured out how to hash the string like git would, now we just need
to compress it and save it. First let's get rid of the object we previously
created.
</p>

<div class="org-src-container">
<pre class="src src-shell">rm .git/objects/05/d5390cf537efeab95b0e80c987b83fc855bca0 &amp;&amp; <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"OK."</span>
</pre>
</div>

<p>
Here we go, this will be much like the previous program except now
it will compress and then save the file!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> hashlib, zlib
<span style="color: #DFAF8F;">hashme</span> = <span style="color: #CC9393;">'Welcome to SeaGL 2019!'</span>
<span style="color: #DFAF8F;">header</span> = <span style="color: #CC9393;">"blob "</span> + <span style="color: #DCDCCC; font-weight: bold;">str</span>(<span style="color: #DCDCCC; font-weight: bold;">len</span>(hashme)) + <span style="color: #CC9393;">"\0"</span>
<span style="color: #DFAF8F;">myblob</span> = (header + hashme).encode(<span style="color: #CC9393;">'utf8'</span>)
<span style="color: #DFAF8F;">gitsha</span> = hashlib.sha1(myblob).hexdigest()
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Calculate filename</span>
<span style="color: #DFAF8F;">gitobj</span> = f<span style="color: #CC9393;">".git/objects/{gitsha[:2]}/{gitsha[2:]}"</span>
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Write out the binary bytes!</span>
<span style="color: #DFAF8F;">myfile</span> = <span style="color: #DCDCCC; font-weight: bold;">open</span>(gitobj, <span style="color: #CC9393;">'wb'</span>)
myfile.write(zlib.compress(myblob))
myfile.close()
<span style="color: #F0DFAF; font-weight: bold;">print</span>(f<span style="color: #CC9393;">"wrote: {gitobj}"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d4fe45" class="outline-2">
<h2 id="org5d4fe45">Did it work?</h2>
<div class="outline-text-2" id="text-org5d4fe45">
<p>
Now let's use <code>git cat-file</code> to verify that our program did everything
right.
</p>

<div class="org-src-container">
<pre class="src src-shell">git cat-file -p 05d5
</pre>
</div>

<pre class="example">
Welcome to SeaGL 2019!
</pre>
</div>
</div>

<div id="outline-container-orgf00cffd" class="outline-2">
<h2 id="orgf00cffd">Final thoughts</h2>
<div class="outline-text-2" id="text-orgf00cffd">
<p>
In a future post, I'll show how we can use similar techniques to craft
git trees and commits. See ya then!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Hamrick</p>
<p class="email">Email: <a href="mailto:mikeh@muppetlabs.com">mikeh@muppetlabs.com</a></p>
<p class="date">Created: 2019-11-13 Wed 22:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
